xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
/**
*   @file    Lin_LPUART.c
*   @version 1.0.1
*
*   @brief   AUTOSAR Lin - LPUART.
*   @details File containing the low level driver of the LPUART IP.
*
*   @addtogroup LIN
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.3 MCAL
*   Platform             : ARM
*   Peripheral           : LPUART,FLEXIO
*   Dependencies         : 
*
*   Autosar Version      : 4.3.1
*   Autosar Revision     : ASR_REL_4_3_REV_0001
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_3_REV_0001_20190621
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2019 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Lin_LPUART_c_REF_1
* Violates MISRA 2004 Required Rule 19.15, Precautions shall be taken
* in order to prevent the contents of a header file being included twice.
* This comes from the order of includes in the .c file and from
* include dependencies. As a safe approach, any file must include all
* its dependencies. Header files are already protected against double
* inclusions. The inclusion of MemMap.h is as per Autosar
* requirement MEMMAP003.
*
* @section Lin_LPUART_c_REF_2
* Violates MISRA 2004 Advisory Rule 19.1, #include statements in a
* file should only be preceded by other preprocessor directives or
* comments. AUTOSAR imposes the specification of the sections in which
* certain parts of the driver must be placed.
*
* @section Lin_LPUART_c_REF_3
* Violates MISRA 2004 Required Rule 11.1, This violation is due to
* the casting pointers to other types used in macros for reading or
* writing data from address location of controller register.
*
* @section Lin_LPUART_c_REF_4
* Violates MISRA 2004 Required Rule 17.4, This violation is due to
* the structure of the types used. The application should ensure that the
* SDU pointer is pointing to an array.
*
* @section Lin_LPUART_c_REF_5
* Violates MISRA 2004 Required Rule 8.10, Not required from Autosar
* specification.
*
* @section Lin_LPUART_c_REF_6
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall
* be checked to ensure that 31 character significance and
* case sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have
* a file version check.
*
* @section Lin_LPUART_c_REF_7
* Violates MISRA 2004 Advisory Rule 11.3, A cast should not be performed between
* a pointer type and an integral type
*
* @section Lin_LPUART_c_REF_8
* Violates MISRA 2004 Required Rule 8.7, Objects shall be defined at block scope if they are only
* accessed from within a single function
*
* @section Lin_LPUART_c_REF_9
* Violates MISRA 2004 Required Rule 12.4, The right-hand operand of a logical && 
* or || operator shall not contain side effects.
*
*/


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Lin.h"
#include "Lin_LPUART.h"
#include "StdRegMacros.h"
#include "Reg_eSys_LPUART.h"
#include "SchM_Lin.h"
/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Lin_LPUART.c
*/
#define LIN_LPUART_VENDOR_ID_C                      43
/**
* @violates @ref Lin_LPUART_c_REF_6 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define LIN_LPUART_AR_RELEASE_MAJOR_VERSION_C       4
/**
* @violates @ref Lin_LPUART_c_REF_6 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define LIN_LPUART_AR_RELEASE_MINOR_VERSION_C       3
/**
* @violates @ref Lin_LPUART_c_REF_6 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define LIN_LPUART_AR_RELEASE_REVISION_VERSION_C    1
#define LIN_LPUART_SW_MAJOR_VERSION_C               1
#define LIN_LPUART_SW_MINOR_VERSION_C               0
#define LIN_LPUART_SW_PATCH_VERSION_C               1
/*==================================================================================================
*                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Lin header file are of the same vendor */
#if (LIN_LPUART_VENDOR_ID_C != LIN_VENDOR_ID)
    #error "Lin_LPUART.c and Lin.h have different vendor ids"
#endif
/* Check if current file and Lin_LPUART header file are of the same vendor */
#if (LIN_LPUART_VENDOR_ID_C != LIN_LPUART_VENDOR_ID)
    #error "Lin_LPUART.c and Lin_LPUART.h have different vendor ids"
#endif
/* Check if current file and Lin_LPUART header file are of the same vendor */
#if (LIN_LPUART_VENDOR_ID_C != REG_ESYS_LPUART_VENDOR_ID)
    #error "Lin_LPUART.c and Reg_eSys_LPUART.h have different vendor ids"
#endif
/* Check if current file and Lin.h header file are of the same Autosar version */
#if ((LIN_LPUART_AR_RELEASE_MAJOR_VERSION_C    != LIN_AR_RELEASE_MAJOR_VERSION) || \
     (LIN_LPUART_AR_RELEASE_MINOR_VERSION_C    != LIN_AR_RELEASE_MINOR_VERSION) || \
     (LIN_LPUART_AR_RELEASE_REVISION_VERSION_C != LIN_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Lin_LPUART.c and Lin.h are different"
#endif
/* Check if current file and Lin.h header file are of the same Software version */
#if ((LIN_LPUART_SW_MAJOR_VERSION_C != LIN_SW_MAJOR_VERSION) || \
     (LIN_LPUART_SW_MINOR_VERSION_C != LIN_SW_MINOR_VERSION) || \
     (LIN_LPUART_SW_PATCH_VERSION_C != LIN_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Lin_LPUART.c and Lin.h are different"
#endif

/* Check if current file and Lin_LPUART.h header file are of the same Autosar version */
#if ((LIN_LPUART_AR_RELEASE_MAJOR_VERSION_C    != LIN_LPUART_AR_RELEASE_MAJOR_VERSION) || \
     (LIN_LPUART_AR_RELEASE_MINOR_VERSION_C    != LIN_LPUART_AR_RELEASE_MINOR_VERSION) || \
     (LIN_LPUART_AR_RELEASE_REVISION_VERSION_C != LIN_LPUART_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Lin_LPUART.c and Lin_LPUART.h are different"
#endif
/* Check if current file and Lin_LPUART.h header file are of the same Software version */
#if ((LIN_LPUART_SW_MAJOR_VERSION_C != LIN_LPUART_SW_MAJOR_VERSION) || \
     (LIN_LPUART_SW_MINOR_VERSION_C != LIN_LPUART_SW_MINOR_VERSION) || \
     (LIN_LPUART_SW_PATCH_VERSION_C != LIN_LPUART_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Lin_LPUART.c and Lin_LPUART.h are different"
#endif

/* Check if current file and Reg_eSys_LPUART.h header file are of the same Autosar version */
#if ((LIN_LPUART_AR_RELEASE_MAJOR_VERSION_C    != REG_ESYS_LPUART_AR_RELEASE_MAJOR_VERSION) || \
      (LIN_LPUART_AR_RELEASE_MINOR_VERSION_C    != REG_ESYS_LPUART_AR_RELEASE_MINOR_VERSION) || \
      (LIN_LPUART_AR_RELEASE_REVISION_VERSION_C != REG_ESYS_LPUART_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Lin_LPUART.c and Reg_eSys_LPUART.h are different"
#endif
/* Check if current file and Reg_eSys_LPUART.h header file are of the same Software version */
#if ((LIN_LPUART_SW_MAJOR_VERSION_C != REG_ESYS_LPUART_SW_MAJOR_VERSION) || \
     (LIN_LPUART_SW_MINOR_VERSION_C != REG_ESYS_LPUART_SW_MINOR_VERSION) || \
     (LIN_LPUART_SW_PATCH_VERSION_C != REG_ESYS_LPUART_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Lin_LPUART.c and Reg_eSys_LPUART.h are different"
#endif

#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
  /* Check if the source file and StdRegMacros header file are of the same version */
  #if ((LIN_LPUART_AR_RELEASE_MAJOR_VERSION_C != STDREGMACROS_AR_RELEASE_MAJOR_VERSION) || \
       (LIN_LPUART_AR_RELEASE_MINOR_VERSION_C != STDREGMACROS_AR_RELEASE_MINOR_VERSION) \
      )
      #error "AutoSar Version Numbers of Lin_LPUART.c and StdRegMacros.h are different"
  #endif
#endif
/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/**
* @brief        Lin_LPUART_LogicalStateType
* @details      Logical state of the transmission for a LPUART channel
*               Used for SendHeader and SendResponse
*/
typedef enum
{
    LPUART_IDLE_U32 = 0x00U,    /**< @brief No transmission ongoing. */
    LPUART_SENDING_BREAK_U32,   /**< @brief Currently sending break. */
    LPUART_SENDING_SYNC_U32,    /**< @brief Currently sending sync byte. */
    LPUART_SENDING_PID_U32,     /**< @brief Currently sending PID. */
    LPUART_SENDING_BYTES_U32,   /**< @brief Currently sending data bytes. */
    LPUART_SENDING_CHECKSUM_U32 /**< @brief Currently sending checksum. */

