xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
} Lin_LPUART_LogicalStateType;

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL VARIABLES
==================================================================================================*/
#define LIN_START_SEC_VAR_NO_INIT_BOOLEAN 
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 /**
* @brief        Store LPUART Checksum type
*/
static volatile VAR(boolean, LIN_VAR) bLPUART_ChecksumType;
#define LIN_STOP_SEC_VAR_NO_INIT_BOOLEAN 
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 
#define LIN_START_SEC_VAR_NO_INIT_8
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 /**
* @brief        Store LPUART data to send or receive
*/
static  volatile VAR(uint8, LIN_VAR) Lin_Lpuart_au8Buffer[LIN_LPUART_MAX_MODULES][LPUART_MAX_BUFFER_LENGTH_U8];

/**
* @brief        Point to the next byte to send or receive in LPUART Buffers
*/
static volatile VAR(uint8, LIN_VAR) Lin_Lpuart_au8BufferPtr[LIN_LPUART_MAX_MODULES];

/**
* @brief        Real sizes of LPUART Buffers
*/
static volatile VAR(uint8, LIN_VAR) Lin_Lpuart_au8BufferLength[LIN_LPUART_MAX_MODULES];

static volatile VAR(uint8, LIN_VAR) Lin_Lpuart_au8WakeupFlag[LIN_LPUART_MAX_MODULES];

#define LIN_STOP_SEC_VAR_NO_INIT_8
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 /*==================================================================================================
*                                       GLOBAL CONSTANTS
==================================================================================================*/
#define LIN_START_SEC_CONST_32
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 
/**
* @brief        LPUART IPs base addresses.
*
* @details      Array containing the base address of all the LPUART IPs.
*
*
* @violates @ref Lin_LPUART_c_REF_5 All declarations and definitions
* of objects or functions at file scope shall have
* internal linkage unless external linkage is required.
*/
CONST(uint32, LIN_CONST) LPUART_au32BaseAddrs[13] =
{
    #ifdef  LPUART0_BASEADDR
        LPUART0_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART1_BASEADDR
        LPUART1_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART2_BASEADDR
        LPUART2_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART3_BASEADDR
        LPUART3_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART4_BASEADDR
        LPUART4_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART5_BASEADDR
        LPUART5_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART6_BASEADDR
        LPUART6_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART7_BASEADDR
        LPUART7_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART8_BASEADDR
        LPUART8_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART9_BASEADDR
        LPUART9_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART10_BASEADDR
        LPUART10_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART11_BASEADDR
        LPUART11_BASEADDR,
    #else
        ((uint32)0x00000000UL),
    #endif
    #ifdef  LPUART12_BASEADDR
        LPUART12_BASEADDR
    #else
        ((uint32)0x00000000UL)
    #endif
};

#define LIN_STOP_SEC_CONST_32


/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 /*==================================================================================================
*                                       GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
#define LIN_START_SEC_CODE
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 
