xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
static FUNC (void, LIN_CODE) Lin_LPUART_CopyData(CONST(uint8, AUTOMATIC) u8Channel, P2VAR(uint8, AUTOMATIC, LIN_APPL_DATA) pu8LinSduPtr);
static FUNC (void, LIN_CODE) Lin_LPUART_PIDCalc(VAR(uint8, AUTOMATIC) u8Channel, VAR(uint8, AUTOMATIC) u8FrameID);
static FUNC (uint32, LIN_CODE) Lin_LPUART_ChecksumCalc(VAR(uint8, AUTOMATIC) u8Channel, VAR(Lin_FrameCsModelType, AUTOMATIC) checksumModel);
static FUNC (void, LIN_CODE) Lin_LPUART_RxBuffFullInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel, VAR(uint8, AUTOMATIC) u8LogicChannel);
static FUNC (void, LIN_CODE) Lin_LPUART_IdleLineDetectInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel, VAR(uint8, AUTOMATIC) u8LogicChannel);
/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
/**
* @brief   Copy the data received from the LPUART data registers to pu8LinSduPtr.
* @details This function shall copy the received data in the provided buffer
*          addressed by the pu8LinSduPtr pointer parameter.
*
* @param[in]   LPUART Channel to be addressed.
* @param[out]  pu8LinSduPtr pointer to pointer to a shadow buffer or memory
*              mapped LPUART Hardware receive buffer where the current SDU is stored
*
* @return       void.
*
*
* @note         Internal driver function.
*
* @violates @ref Lin_LPUART_c_REF_5 All declarations and definitions
*                of objects or functions at file scope shall have
*                internal linkage unless external linkage is required.
*/
static FUNC (void, LIN_CODE) Lin_LPUART_CopyData(CONST(uint8, AUTOMATIC) u8Channel, P2VAR(uint8, AUTOMATIC, LIN_APPL_DATA) pu8LinSduPtr)
{
    uint8 u8Index;
    uint8 u8BufferLength;

    u8BufferLength = (uint8)(Lin_Lpuart_au8BufferLength[u8Channel] - (uint8)3U);

    for(u8Index = (uint8)0U; u8Index < u8BufferLength; u8Index++)
    {
        /**
        * @violates @ref Lin_LPUART_c_REF_4 pointer arithmetic other
        *                than array indexing used
        */
        pu8LinSduPtr[u8Index] = Lin_Lpuart_au8Buffer[u8Channel][LPUART_DATA_OFFSET_U8 + u8Index];
    }
}

/**
* @brief   Calculate Protected Identifier from the Frame ID.
* @details Calculate Protected Identifier from the Frame ID.
*
* @param[in]   u8LPUART_Channel, u8FrameID - Frame ID.
* @param[out]  void.
*
* @return       void.
*
*
* @note         Internal driver function.
*
*/
static FUNC (void, LIN_CODE) Lin_LPUART_PIDCalc(VAR(uint8, AUTOMATIC) u8Channel, VAR(uint8, AUTOMATIC) u8FrameID)
{
    uint32 u32Temp1;
    uint32 u32Temp2;

    u32Temp1 = ((uint32)u8FrameID) & LPUART_FRAME_ID_MASK_U32;
    u32Temp2 = u8FrameID;
    /* Calculate parity bit P1 = !(ID1 ^ ID3 ^ ID4 ^ ID5) */
    u32Temp1 |= ((((u32Temp2 >> 1) ^ \
                   (u32Temp2 >> 3) ^ \
                   (u32Temp2 >> 4) ^ \
                   (u32Temp2 >> 5) \
                  )& ((uint32)1U) \
                 ) ^ ((uint32)1U) \
                ) << (uint32)7U;

    /* Calculate parity bit P0 = (ID0 ^ ID1 ^ ID2 ^ ID4) */
    u32Temp1 |= (((u32Temp2) ^ \
                  (u32Temp2 >> 1U) ^ \
                  (u32Temp2 >> 2U) ^ \
                  (u32Temp2 >> 4U) \
                 ) & ((uint32)1U) \
                ) << (uint32)6U;

    Lin_Lpuart_au8Buffer[u8Channel][LPUART_PID_BYTE_OFFSET_U8] = (uint8)u32Temp1;
}

/**
* @brief   Calculate LIN Checksum.
* @details Calculate LIN Checksum.
*
* @param[in]   u8LPUART_Channel, checksumModel.
* @param[out]  u32Checksum.
*
* @return       uint32.
*
* @note         Internal driver function.
*
*/
static FUNC (uint32, LIN_CODE) Lin_LPUART_ChecksumCalc(VAR(uint8, AUTOMATIC) u8Channel, VAR(Lin_FrameCsModelType, AUTOMATIC) checksumModel)
{
    uint32 u32Checksum = (uint32)0U;
    uint32 u32Carry = (uint32)0U;
    uint32 u32DataLen = (uint32)0U;
    uint32 u32Index = (uint32)0U;

    u32DataLen = ((uint32)Lin_Lpuart_au8BufferLength[u8Channel]) - ((uint32)3U);
    /* Enhanced Model */
    if(LIN_ENHANCED_CS == checksumModel)
    {
        u32Checksum = (uint32)Lin_Lpuart_au8Buffer[u8Channel][LPUART_PID_BYTE_OFFSET_U8];
    }

    for(u32Index = (uint32)0U; u32Index < u32DataLen; u32Index++)
    {
        u32Checksum += (uint32)Lin_Lpuart_au8Buffer[u8Channel][LPUART_DATA_OFFSET_U8 + u32Index];
        u32Carry = u32Checksum >> (uint32)8U;
        u32Checksum = (u32Checksum & ((uint32)0xFFU)) + u32Carry;
    }

    u32Checksum = (~(u32Checksum)) & ((uint32)0xFFU);
    return u32Checksum;
}

/**
* @brief   Interrupt handler for RX Data Register Full on LPUART.
* @details This function shall manage the RX ISRs on the
*          addressed channel.
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return       void.
*
* @implements Lin_LPUART_RxBuffFullInterruptHandler_Activity
*
* @note         Internal driver function.
*/
static FUNC (void, LIN_CODE) Lin_LPUART_RxBuffFullInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel, VAR(uint8, AUTOMATIC) u8LogicChannel)
{
    VAR(uint8, AUTOMATIC) u8Temp1;
    VAR(uint32, AUTOMATIC) u32Lin_DataReg;
    VAR(uint8, AUTOMATIC) u8BufferPtr;
    VAR(uint8, AUTOMATIC) u8BufferLength;
    VAR(uint8, AUTOMATIC) au8Lin_Command;
    VAR(uint8, AUTOMATIC) u8LogicalChannel = (uint8)u8LogicChannel;
    VAR(uint8, AUTOMATIC) u8Lin_FrameID;
    VAR(uint8, AUTOMATIC) u8Lin_Checksum;
    VAR(boolean, AUTOMATIC) bIsSleepFrame = (boolean)FALSE;

    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_12();
    {
        /* Disable Receiver Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_12();

    /* Read the data register */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    u32Lin_DataReg = REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));
    u8BufferPtr = Lin_Lpuart_au8BufferPtr[u8LogicalChannel];
    u8BufferLength = Lin_Lpuart_au8BufferLength[u8LogicalChannel];
    /* Get Lin Frame Command */
    au8Lin_Command = Lin_au8TransmitHeaderCommand[u8LogicalChannel];
    /* Get the last transmitted byte */
    u8Temp1 = Lin_Lpuart_au8Buffer[u8LogicalChannel][u8BufferPtr];

    if(u8BufferPtr >= u8BufferLength)
    {
        /* Code Flow Error */
    }
    /* The next byte has been received */
    else
    {
        switch(u8BufferPtr)
        {
            /* Check SYNCH byte */
            case LPUART_SYNCH_BYTE_OFFSET_U8:
                if((uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32) != u8Temp1)
                {
                    /* Bit error detected */
                    Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BIT_ERROR;
                    if(LIN_TX_SLEEP_COMMAND == au8Lin_Command)
                    {
                        bIsSleepFrame = (boolean)TRUE;
                    }
                }
                else
                {
                    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_25();
                    {
                        /* Enable Transmit Interrupt */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
                    }
                    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_25();
                }
                break;
            default:
                switch(au8Lin_Command)
                {
                    case LIN_TX_MASTER_RES_COMMAND:
                        /* Verify received data */
                        if((uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32) != u8Temp1)
                        {
                            /* Bit error detected */
                            Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BIT_ERROR;
                        }
                        else
                        {
                            /* The last byte has been received */
                            if(u8BufferPtr == (u8BufferLength - (uint8)1U))
                            {
                                Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_TX_COMPLETE_STATE;
                            }
                            else
                            {
                                SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_15();
                                {
                                    /* Enable Transmit Interrupt */
                                    /**
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                    */
                                    REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
                                }
                                SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_15();
                            }
                        }
                        break;
                    case LIN_TX_SLEEP_COMMAND:
                        /* Verify received data */
                        if((uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32) != u8Temp1)
                        {
                            /* Bit error detected */
                            Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BIT_ERROR;
                            bIsSleepFrame = (boolean)TRUE;
                        }
                        else
                        {
                            /* The last byte has been received */
                            if(u8BufferPtr == (u8BufferLength - (uint8)1U))
                            {
                                /* Update Lin_au8TransmitHeaderCommand value to LIN_TX_NO_COMMAND */
                                Lin_au8TransmitHeaderCommand[u8LogicalChannel] = LIN_TX_NO_COMMAND;

                                /* Reset buffer length */
                                Lin_Lpuart_au8BufferLength[u8LogicalChannel] = (uint8)0U;
                                 if ((uint8) STD_ON == Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelWakeupSupport)
                                {
                                    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_16();
                                    {
                                        /* Enable wake up detection */
                                        /* Clear RX Pin Active Edge Interrupt Flag */
                                        /**
                                        *
                                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                        *
                                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                        */
                                        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));

                                        /* Enable RX Input Active Edge Interrupt Enable */
                                        /**
                                        *
                                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                        *
                                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                        */
                                        REG_BIT_SET32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
                                    }
                                    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_16();
                                }
                             }
                            else
                            {
                                SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_17();
                                {
                                    /* Enable Transmit Interrupt */
                                    /**
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                    */
                                    REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
                                }
                                SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_17();
                            }
                        }
                        break;
                    case LIN_TX_SLAVE_RES_COMMAND:
                        if(LPUART_DATA_NOISY_MASK_U32 == (u32Lin_DataReg & LPUART_DATA_NOISY_MASK_U32))
                        {
                            /* Set LIN channel frame error status to LIN_NOISE_ERROR */
                            Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_NOISE_ERROR;
                        }
                        else if(((uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32) != u8Temp1) && (LPUART_PID_BYTE_OFFSET_U8 == u8BufferPtr))
                        {
                            /* Bit error detected */
                            Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BIT_ERROR;
                        }
                        else if(LPUART_PID_BYTE_OFFSET_U8 < u8BufferPtr)
                        {
                            /* Store received data */
                            Lin_Lpuart_au8Buffer[u8LogicalChannel][u8BufferPtr] = (uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32);

                            /* Update LIN channel frame operation status to LIN_RX_ONGOING_STATE */
                            Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_RX_ONGOING_STATE;

                            /* The last byte has been received */
                            if(u8BufferPtr == (u8BufferLength - (uint8)1U))
                            {
                                u8Lin_FrameID = Lin_Lpuart_au8Buffer[u8LogicalChannel][LPUART_PID_BYTE_OFFSET_U8];
                                /* Checksum Error */
                                switch(u8Lin_FrameID)
                                {
                                    case LPUART_MASTER_REQUEST_DIAGNOSTIC_PID_U8:
                                    case LPUART_SLAVE_RESPONSE_DIAGNOSTIC_PID_U8:
                                        u8Lin_Checksum = (uint8)Lin_LPUART_ChecksumCalc(u8LogicalChannel, LIN_CLASSIC_CS);
                                    break;
                                    default:
                                        if ((boolean)TRUE == bLPUART_ChecksumType)
                                        {
                                            /* Enhance checksum */
                                            u8Lin_Checksum = (uint8)Lin_LPUART_ChecksumCalc(u8LogicalChannel, LIN_ENHANCED_CS);
                                        }
                                        else
                                        {
                                            /* Classic checksum */
                                            u8Lin_Checksum = (uint8)Lin_LPUART_ChecksumCalc(u8LogicalChannel, LIN_CLASSIC_CS);
                                        }
                                    break;
                                }
                                if(u8Lin_Checksum != (uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32))
                                {
                                    /* Set LIN channel frame error status to LIN_CHECKSUM_ERROR */
                                    Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_CHECKSUM_ERROR;
                                }
                                else
                                {
                                    /* Update LIN channel frame operation status to LIN_RX_COMPLETE_STATE */
                                    Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_RX_COMPLETE_STATE;
                                }
                            }
                            else
                            {
                                SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_18();
                                {
                                    /* Enable Receiver Interrupt */
                                    /**
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                    *
                                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                    */
                                    REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
                                }
                                SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_18();
                            }
                        }
                        else
                        {
                            /* Update LIN channel frame operation status to LIN_TX_HEADER_COMPLETE_STATE */
                            Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_TX_HEADER_COMPLETE_STATE;

                            SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_13();
                            {
                                /* Enable Receiver Interrupt */
                                /**
                                *
                                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                                *
                                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                                */
                                REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
                            }
                            SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_13();
                        }
                        break;
                    case LIN_TX_SLAVE_TO_SLAVE_COMMAND:
                    /* Verify received data */
                        if((uint8)(u32Lin_DataReg & LPUART_DATA_8BITS_MASK_U32) != u8Temp1)
                        {
                            /* Bit error detected */
                            Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BIT_ERROR;
                        }
                        else
                        {
                            Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_TX_HEADER_COMPLETE_STATE;
                        }
                        break;
                    default:
                        break;
                }
                break;
        }
        if((boolean)TRUE == bIsSleepFrame)
        {
            /* Update Lin_au8TransmitHeaderCommand value to LIN_TX_NO_COMMAND */
            Lin_au8TransmitHeaderCommand[u8LogicalChannel] = LIN_TX_NO_COMMAND;
            /* Enable wake up detection */
             if ((uint8) STD_ON == Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelWakeupSupport)
            {
                SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_14();
                {
                /* Clear RX Pin Active Edge Interrupt Flag */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));

                /* Enable RX Input Active Edge Interrupt Enable */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_BIT_SET32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
                }
                SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_14();
            }
         }
        /* Increase Buffer Pointer */
        Lin_Lpuart_au8BufferPtr[u8LogicalChannel]++;
    }
}

/**
* @brief   Interrupt handler for Idle line detected on LPUART.
* @details This function shall manage the RX ISRs on the
*          addressed channel.
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return       void.
*
* @implements Lin_LPUART_IdleLineDetectInterruptHandler_Activity
*
* @note         Internal driver function.
*/
static FUNC (void, LIN_CODE) Lin_LPUART_IdleLineDetectInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel, VAR(uint8, AUTOMATIC) u8LogicChannel)
{
    VAR(uint8, AUTOMATIC) u8Temp1;
    VAR(uint8, AUTOMATIC) u8LogicalChannel = (uint8)u8LogicChannel;

