xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_20();
    {
        /* Clear Idle Line Interrupt Flag */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_IDLE_MASK_U32));

        /* Disable Idle Line Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ILIE_MASK_U32);
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_20();

    u8Temp1 = Lin_au8LinChStatus[u8LogicalChannel];
    /* Check whether the Lin channel status is in LIN_CH_SLEEP_STATE */
    if (LIN_CH_SLEEP_STATE == u8Temp1)
    {
        /* Discard data from Rx buffer */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_21();
        {
            /* Clear Error Flags */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_ERR_FLAGS_MASK_U32));
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_21();

        /* Check whether wake up detection is enabled */
         if ((uint8)STD_ON == Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelWakeupSupport)
        {
            /* Indicates a valid timer wakeup event to ECU State Manager */
             EcuM_CheckWakeup(Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->LinChannelEcuMWakeupSource);
             /* Update Wakeup Flag */
            Lin_Lpuart_au8WakeupFlag[u8LogicalChannel] = (uint8)FALSE;
            /* Set Channel state Operational */
            Lin_au8LinChStatus[u8LogicalChannel] = LIN_CH_OPERATIONAL;
            /* Update LIN channel frame operation status to LIN_CH_READY_STATE */
            Lin_au8LinChFrameStatus[u8LogicalChannel] = LIN_CH_READY_STATE;
        }
        else
        {
            /* Update Wakeup Flag */
            Lin_Lpuart_au8WakeupFlag[u8LogicalChannel] = (uint8)TRUE;
        }
    }
    else
    {
        /* Do nothing */
    }
}

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

/*================================================================================================*/

/**
* @brief   Check if a LIN channel has been waked-up.
* @details This function identifies if the addressed LIN channel
*          has been woken up by the LIN bus transceiver. This API
*          is used when the LIN channel wake up functionality is
*          disabled (wake up interrupt is disabled). It checks
*          the wake up flag from the addressed LIN channel which
*          must be in sleep mode and have the wake up
*          functionality disabled.
*
* @param[in] Channel LIN channel to be waked-up.
*
* @return            Std_ReturnType.
* @retval E_OK       If the LIN Channel has the wake
*                    up flag set and the wake up ISR disabled
* @retval E_NOT_OK   Otherwise.
*
*/
FUNC (Std_ReturnType, LIN_CODE) Lin_LPUART_CheckWakeup(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(Std_ReturnType, AUTOMATIC) u8TempReturn;

    u8TempReturn = Lin_Lpuart_au8WakeupFlag[u8Channel];

    if((uint8)TRUE == u8TempReturn)
    {
        /* Reset Wakeup Flag */
        Lin_Lpuart_au8WakeupFlag[u8Channel] = (uint8)FALSE;
    }
    else
    {
        /* Do nothing */
    }

    return u8TempReturn;
}

/**
* @brief   Initialize a LIN channel.
* @details This function initializes all hardware registers needed to
*          start the LIN functionality on the selected channel.
*
* @param[in] Channel LIN channel to be initialized.
*
* @return            void.
*
*/
FUNC(void, LIN_CODE) Lin_LPUART_InitChannel(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint32, AUTOMATIC) u32Counter = (uint32)0U;

    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    /* Check whether wake up detection is enabled */
     if ((uint8) STD_ON == Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinChannelWakeupSupport)
     {
        /* Check Wakeup event */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        if(LPUART_STAT_IDLE_MASK_U32 == (REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & LPUART_STAT_IDLE_MASK_U32))
        {
            /* The wake-up shall directly be reported to the EcuM
               via EcuM_SetWakeupEvent call-back function. */
             EcuM_SetWakeupEvent(Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->LinChannelEcuMWakeupSource);
         }
    }

    /* Reset LPUART registers */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_BIT_SET32(LPUART_GLOBAL_ADDR32(u8LPUART_Channel), LPUART_GLOBAL_RST_MASK_U32);
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_BIT_CLEAR32(LPUART_GLOBAL_ADDR32(u8LPUART_Channel), LPUART_GLOBAL_RST_MASK_U32);

