xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_00();
    {
        /* Disable LPUART Receiver and Transmitter */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TE_MASK_U32);

        /* Config break length */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_SET32(LPUART_STAT_ADDR32(u8LPUART_Channel), LPUART_STAT_BRK13_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_M_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_M10_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_M7_MASK_U32);

        /* Initialize baud rate */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_RMW32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_OSR_MASK_U32, LPUART_BAUD_OSR_U32(LPUART_BAUD_OSR_16_BITS_U32));
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_RMW32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_SBR_MASK_U32, LPUART_BAUD_SBR_U32(Lin_pcConfigPtr->pLin_Channel[u8Channel]->u32Lin_BaudRate_RegValue));

        /* Configure LSB (bit0) to be the first bit that is transmitted following the start bit */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_STAT_ADDR32(u8LPUART_Channel), LPUART_STAT_MSBF_MASK_U32);

        /* No hardware parity generation or checking */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_PE_MASK_U32);

        /* LPUART Interrupts' Initialization - Disable all interrupts */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_INT_FLAGS_MASK_U32));
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_IE_FLAGS_MASK_U32);

        /* Clear Wakeup Flags */
        Lin_Lpuart_au8WakeupFlag[u8Channel] = (uint8)FALSE;

        /* Enable LPUART Transmitter */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TE_MASK_U32);
        /* Enable LPUART Receiver */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RE_MASK_U32);

        /* After LPUART Transmitter is enabled, a preamble character that is one full character frame of the idle state will be queued automatically */
        while(u32Counter <= (LIN_TIMEOUT_LOOPS + (uint32)1U))
        {
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            if( (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32) == ( REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32)))
            {
                break;
            }
            else
            {
                u32Counter++;
            }
        }
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_00();

     SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_26();
    {
        /* Create Sleep mode fake*/
        /* Disable LPUART Receiver and Transmitter Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        
        /* Reset buffer length */
        Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;

        /* Check whether wake-up detection by interrupt is enabled */
        if ((uint8) STD_ON == Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinChannelWakeupSupport)
        {
            /* Enable wake up detection */
            /* Clear RX Pin Active Edge Interrupt Flag */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));
            /* Enable RX Input Active Edge Interrupt Enable */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_SET32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
        }
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_26();
 }

/**
* @brief   Sends the header part of the LIN frame.
* @details Initiates the transmission of the header
*          part of the LIN frame on Channel using information
*          stored on PduInfoPtr pointer.
*          If response type is MASTER_RESPONSE then nothing is sent over the bus
*          the entire frame (including header) is sent with the Lin_LPUART_SendReponse
*
* @param[in]   Channel LIN channel to be addressed.
* @param[in]   PduInfoPtr pointer to PDU containing the PID, Checksum model,
*              Response type, Dl and SDU data pointer.
*
* @return            Std_ReturnType.
* @retval E_NOT_OK   In case of a time out situation only.
* @retval E_OK       Otherwise.
*
*/
FUNC (Std_ReturnType, LIN_CODE) Lin_LPUART_SendHeader(CONST(uint8, AUTOMATIC) u8Channel, P2CONST(Lin_PduType, AUTOMATIC, LIN_APPL_CONST) pPduInfoPtr)
{
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint32, AUTOMATIC) volatile u32Counter = 0U;
    VAR(Std_ReturnType, AUTOMATIC) u8TmpReturn = (uint8)E_NOT_OK;

