xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_01();
    {
        /** Stop any ongoing transmission */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);

        MCAL_FAULT_INJECTION_POINT(LPUART_FIP_1_T_TIME_OUT_1);

        /* wait till Cancellation of current frame */
        while(u32Counter <= (LIN_TIMEOUT_LOOPS + (uint32)1U))
        {
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            if( (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32) == ( REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32)))
            {
                u8TmpReturn = (uint8)E_OK;
                break;
            }
            else
            {
                u32Counter++;
            }
        }
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_01();

    /* Discard LPUART Rx Buffer */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

    if((uint8)E_OK == u8TmpReturn)
    {
        /* Reset error status global flag */
        Lin_au8LinChFrameErrorStatus[u8Channel] = LIN_NO_ERROR;
        /* Set checksum type, use for interrupt */
        if (LIN_ENHANCED_CS == pPduInfoPtr->Cs)
        {
            /* Update LIN Checksum type to LIN_ENHANCED_CS */
            bLPUART_ChecksumType = (boolean)TRUE;
        }
        else
        {
            /* Update LIN Checksum type to LIN_CLASSIC_CS */
            bLPUART_ChecksumType = (boolean)FALSE;
        }
        /* Set header status to TRUE if master wants to send the response frame */
        if (LIN_MASTER_RESPONSE == pPduInfoPtr->Drc)
        {
            Lin_au8TransmitHeaderCommand[u8Channel] = LIN_TX_MASTER_RES_COMMAND;
            /* Update LIN channel frame operation status to LIN_CH_READY_STATE */
            Lin_au8LinChFrameStatus[u8Channel] = LIN_CH_READY_STATE;
        }
        else if(LIN_SLAVE_RESPONSE == pPduInfoPtr->Drc)
        {
            Lin_au8TransmitHeaderCommand[u8Channel] = LIN_TX_SLAVE_RES_COMMAND;
            Lin_au8LinChFrameStatus[u8Channel] = LIN_CH_RECEIVE_NOTHING_STATE;
        }
        else
        {
            Lin_au8TransmitHeaderCommand[u8Channel] = LIN_TX_SLAVE_TO_SLAVE_COMMAND;
            Lin_au8LinChFrameStatus[u8Channel] = LIN_CH_RECEIVE_NOTHING_STATE;
        }
        /* The buffer contains [sync byte, pid, data, checksum] */
        Lin_Lpuart_au8BufferLength[u8Channel] = ((uint8)3U) + ((pPduInfoPtr->Dl > LPUART_MAX_DATA_LENGTH_U8) ? LPUART_MAX_DATA_LENGTH_U8 : pPduInfoPtr->Dl);

        /* Write in the transmission buffer the synchronization byte and the PID */
        Lin_Lpuart_au8Buffer[u8Channel][LPUART_SYNCH_BYTE_OFFSET_U8] = LPUART_SYNC_BYTE_U8;
        Lin_LPUART_PIDCalc(u8Channel, pPduInfoPtr->Pid);

        /* Set Data Direction */
        if (LIN_MASTER_RESPONSE == pPduInfoPtr->Drc)
        {
            /* Do not transmit header here because it's a master->slave frame
            the header will be transmitted together with the response when calling SendResponse function */
        }
        else
        {
            /* Transmit Header */
            /* Set next byte to send the sync byte. This will be used in the transmission complete interrupt */
            Lin_Lpuart_au8BufferPtr[u8Channel] = LPUART_SYNCH_BYTE_OFFSET_U8;

            SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_02();
            {
                /* Disable Error Interrupts */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_RMW32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ONFIE_MASK_U32, LPUART_CTRL_ONFIE_DISABLE_U32);

                /* Discard LPUART Rx Buffer */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));
                /* Send break by toggling CTRL_SBK bit */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);

                /* Enable Transmission Complete Interrupt */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);
            }
            SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_02();
        }
    }
    return u8TmpReturn;
}

/**
* @brief   Sends the response part of the LIN frame.
* @details Initiates the transmission of the data
*          part of the LIN frame on Channel using information
*          stored on PduInfoPtr pointer.
*
* @param[in]   Channel LIN channel to be addressed.
* @param[in]   PduInfoPtr pointer to PDU containing the PID, Checksum model,
*              Response type, Dl and SDU data pointer.
*
* @return            void.
*
*/
FUNC (void, LIN_CODE) Lin_LPUART_SendResponse(CONST(uint8, AUTOMATIC) u8Channel, P2CONST(Lin_PduType, AUTOMATIC, LIN_APPL_CONST) pPduInfoPtr)
{
    VAR(uint8, AUTOMATIC) u8Loop = (uint8)0U;
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint8, AUTOMATIC) u8Lin_FrameID;

