xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    /* Tx Buffer Preparation */
    /* Data */
    for(u8Loop = (uint8)0U; u8Loop < ((pPduInfoPtr->Dl > LPUART_MAX_DATA_LENGTH_U8) ? LPUART_MAX_DATA_LENGTH_U8 : pPduInfoPtr->Dl); u8Loop++)
    {
        /**
        * @violates @ref Lin_LPUART_c_REF_4 pointer arithmetic other
        *                than array indexing used
        */
        Lin_Lpuart_au8Buffer[u8Channel][LPUART_DATA_OFFSET_U8 + u8Loop] = pPduInfoPtr->SduPtr[u8Loop];
    }
    /* Checksum */
    u8Lin_FrameID = pPduInfoPtr->Pid;
    switch(u8Lin_FrameID)
    {
        case LPUART_MASTER_REQUEST_DIAGNOSTIC_ID_U8:
        case LPUART_SLAVE_RESPONSE_DIAGNOSTIC_ID_U8:
            Lin_Lpuart_au8Buffer[u8Channel][Lin_Lpuart_au8BufferLength[u8Channel] - ((uint8)1U)] = (uint8)Lin_LPUART_ChecksumCalc(u8Channel, LIN_CLASSIC_CS);
        break;
        default:
            if ((boolean)TRUE == bLPUART_ChecksumType)
            {
                /* Enhance checksum */
                Lin_Lpuart_au8Buffer[u8Channel][Lin_Lpuart_au8BufferLength[u8Channel] - ((uint8)1U)] = (uint8)Lin_LPUART_ChecksumCalc(u8Channel, LIN_ENHANCED_CS);
                bLPUART_ChecksumType = (boolean)TRUE;
            }
            else
            {
                /* Classic checksum */
                Lin_Lpuart_au8Buffer[u8Channel][Lin_Lpuart_au8BufferLength[u8Channel] - ((uint8)1U)] = (uint8)Lin_LPUART_ChecksumCalc(u8Channel, LIN_CLASSIC_CS);
                bLPUART_ChecksumType = (boolean)FALSE;
            }
        break;
    }
    /* Transmit Header */
    /* Set next byte to send the sync byte. This will be used in the transmission complete interrupt */
    Lin_Lpuart_au8BufferPtr[u8Channel] = LPUART_SYNCH_BYTE_OFFSET_U8;

    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_03();
    {
        /* Disable Error Interrupts */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_RMW32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ONFIE_MASK_U32, LPUART_CTRL_ONFIE_DISABLE_U32);

        /* Discard LPUART Rx Buffer */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));
        /* Send break by toggling CTRL_SBK bit */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);

        /* Enable Transmission Complete Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_03();
}

/**
* @brief   Prepares and send a go-to-sleep-command
*          frame on Channel.
* @details This function stops any ongoing transmission and initiates
*          the transmission of the sleep command (master command frame with
*          ID = 0x3C and data = (0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF).
*
* @param[in] Channel LIN channel to be addressed.
*
* @return            Std_ReturnType.
* @retval E_NOT_OK   In case of a time-out situation only.
* @retval E_OK       Otherwise.
*
*/
FUNC (Std_ReturnType, LIN_CODE) Lin_LPUART_GoToSleep(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint32, AUTOMATIC) volatile u32Counter = 0U;
    VAR(Std_ReturnType, AUTOMATIC) u8TmpReturn = (uint8)E_NOT_OK;

    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_04();
    {
        /** Stop any ongoing transmission */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);

        MCAL_FAULT_INJECTION_POINT(LPUART_FIP_2_T_TIME_OUT_2);

        /* wait till Cancellation of current frame */
        while(u32Counter <= (LIN_TIMEOUT_LOOPS + ((uint32)1U)))
        {
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            if( (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32) == ( REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32)))
            {
                u8TmpReturn = (uint8)E_OK;
                break;
            }
            else
            {
                u32Counter++;
            }
        }
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_04();

    /* Discard LPUART Rx Buffer */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

    if((uint8)E_OK == u8TmpReturn)
    {
        Lin_Lpuart_au8BufferLength[u8Channel] = LPUART_MAX_BUFFER_LENGTH_U8;

        /* Prepare header */
        /* Synch byte */
        Lin_Lpuart_au8Buffer[u8Channel][LPUART_SYNCH_BYTE_OFFSET_U8] = LPUART_SYNC_BYTE_U8;

        /* Protected Identifier */
        Lin_LPUART_PIDCalc(u8Channel, LPUART_MASTER_REQUEST_DIAGNOSTIC_ID_U8);

        /* The Go to sleep command is (0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF) */
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)2U] = LPUART_DATA_0_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)3U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)4U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)5U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)6U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)7U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)8U] = LPUART_DATA_255_U8;
        Lin_Lpuart_au8Buffer[u8Channel][(uint8)9U] = LPUART_DATA_255_U8;

        /* The Classic checksum for the go to sleep frame is 0x00  */
        Lin_Lpuart_au8Buffer[u8Channel][Lin_Lpuart_au8BufferLength[u8Channel] - ((uint8)1U)] = (uint8)Lin_LPUART_ChecksumCalc(u8Channel, LIN_CLASSIC_CS);

        /* Set next byte to send the sync byte. This will be used in the transmission complete interrupt */
        Lin_Lpuart_au8BufferPtr[u8Channel] = LPUART_SYNCH_BYTE_OFFSET_U8;

        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_05();
        {
            /* Disable Error Interrupts */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_RMW32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ONFIE_MASK_U32, LPUART_CTRL_ONFIE_DISABLE_U32);

            /* Discard LPUART Rx Buffer */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

            /* Send break by toggling CTRL_SBK bit */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_SBK_MASK_U32);

