xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
            /* Set header command type is sleep*/
            Lin_au8TransmitHeaderCommand[u8Channel] = LIN_TX_SLEEP_COMMAND;

            /* Enable Transmission Complete Interrupt */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_05();
    }
    return u8TmpReturn;
}

/**
* @brief   Same function as Lin_LLD_GoToSleep() but
*          without sending a go-to-sleep-command on the bus.
* @details This function stops any ongoing transmission and put the
*          Channel in sleep mode (then LIN hardware enters a
*          reduced power operation mode).
*
* @param[in] Channel LIN channel to be addressed.
*
* @return            Std_ReturnType.
* @retval E_NOT_OK   In case of a time-out situation only.
* @retval E_OK       Otherwise.
*
*/
FUNC (Std_ReturnType, LIN_CODE) Lin_LPUART_GoToSleepInternal(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint32, AUTOMATIC) volatile u32Counter = 0U;
    VAR(Std_ReturnType, AUTOMATIC) u8TmpReturn = (uint8)E_NOT_OK;

    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_06();
    {
        /** Stop any ongoing transmission */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        /* Disable Receiver Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);

        MCAL_FAULT_INJECTION_POINT(LPUART_FIP_3_T_TIME_OUT_3);

        /* wait till Cancellation of current frame */
        while(u32Counter <= (LIN_TIMEOUT_LOOPS + ((uint32)1U)))
        {
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            if( (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32) == ( REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32)))
            {
                u8TmpReturn = (uint8)E_OK;
                break;
            }
            else
            {
                u32Counter++;
            }
        }
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_06();

    /* Discard LPUART Rx Buffer */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

    /* Sleep Command */
    /* Set Channel State to Sleep */
    Lin_au8LinChStatus[u8Channel] = LIN_CH_SLEEP_STATE;
    /* Update Lin_au8TransmitHeaderCommand value to LIN_TX_NO_COMMAND */
    Lin_au8TransmitHeaderCommand[u8Channel] = LIN_TX_NO_COMMAND;

    /* Reset buffer length */
    Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;

    if((uint8)E_OK == u8TmpReturn)
    {
        /* Enter Sleep mode */
        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_07();
        {
            /* Enable wake up detection */
            /* Clear RX Pin Active Edge Interrupt Flag */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));
            /* Enable RX Input Active Edge Interrupt Enable */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_SET32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_07();
    }
    return u8TmpReturn;
}

/**
* @brief   Sends a wake up signal to the LIN bus.
* @details This function shall sent a wake up signal to the LIN bus
*          and put the LIN channel in LIN_CH_OPERATIONAL state.
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return            void.
*
*/
FUNC (void, LIN_CODE) Lin_LPUART_WakeUp(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(uint32, AUTOMATIC) u32Counter = (uint32)0U;
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;
    VAR(uint8, AUTOMATIC) u8WakeupByte;

    /* Get the hardware Lin channel from logical channel */
     u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
 
    u8WakeupByte = (uint8)((LPUART_MIN_WAKEUP_PULSE_LENGTH_U32/LPUART_BIT_LENGTH32(Lin_pcConfigPtr->pLin_Channel[u8Channel]->u32Baudrate)) + (uint8)1U);
    u8WakeupByte = (uint8)(~((uint8)((uint8)((uint32)1U << u8WakeupByte) - (uint8)1U)));

    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_08();
    {
        /* Disable Transmit Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        /* Disable Receiver Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /* Disable Transmission Complete Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);

