xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
        /* wait till LPUART transmitter is available */
        while(u32Counter <= (LIN_TIMEOUT_LOOPS + (uint32)1U))
        {
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            if( (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32) == ( REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (LPUART_STAT_TDRE_MASK_U32 | LPUART_STAT_TC_MASK_U32)))
            {
                break;
            }
            else
            {
                u32Counter++;
            }
        }
        /* Reset Buffer Length if Lin channel already sleep but fame slave not finished */
        /**
        * @violates @ref Lin_LPUART_c_REF_9 The right-hand operand shall not contain side effects
        */
        if((LIN_CH_SLEEP_STATE == Lin_au8LinChStatus[u8Channel]) && (0U != Lin_Lpuart_au8BufferLength[u8Channel]))
        {
            Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;
        }
        /* Disable wake up detection */
        /* Clear RX Pin Active Edge Interrupt Flag */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));
        /* Disable RX Input Active Edge Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_08();

    /* Send Wake up request */
    /**
    *
    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
    *
    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
    */
    REG_WRITE32(LPUART_DATA_ADDR32(u8LPUART_Channel), u8WakeupByte);
}

 /**
* @brief   Wake up the LIN channel.
* @details This function shall put the LIN channel in LIN_CH_OPERATIONAL state without
*          sending a wake up signal to the LIN bus
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return            void.
*
*/
FUNC(void, LIN_CODE) Lin_LPUART_WakeupInternal(CONST(uint8, AUTOMATIC) u8Channel)
{
    VAR(uint8, AUTOMATIC) u8LPUART_Channel;

    /* Get the hardware Lin channel from logical channel */
    u8LPUART_Channel = Lin_pChannelConfigPtr[u8Channel]->pChannelConfigPC->u8LinHwChannel;
    
    /* Reset Buffer Length if Lin channel already sleep but fame slave not finished */
    /**
    * @violates @ref Lin_LPUART_c_REF_9 The right-hand operand shall not contain side effects
    */
    if((LIN_CH_SLEEP_STATE == Lin_au8LinChStatus[u8Channel]) && (0U != Lin_Lpuart_au8BufferLength[u8Channel]))
    {
        Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;
    }

    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_09();
    {
        /* Disable Transmit Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
        /* Disable Receiver Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        /* Disable Transmission Complete Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);
        /* Disable wake up detection */
        /* Clear RX Pin Active Edge Interrupt Flag */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));
        /* Disable RX Input Active Edge Interrupt */
        /**
        *
        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
        *
        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
        */
        REG_BIT_CLEAR32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);
    }
    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_09();
}
 
/**
 * @brief   Gets the status of the LIN driver when Channel is operating.
 * @details This function returns the state of the current
 *          transmission, reception or operation status.
 *          If the reception of a Slave response was successful then
 *          this service provides a pointer to the buffer where the
 *          data is stored.
 *
 * @param[in]   Channel LIN channel to be addressed
 * @param[out]  pu8LinSduPtr pointer to pointer to a shadow buffer or memory
 *              mapped LIN Hardware receive buffer where the current SDU is
 *              stored
 * @return                  Lin_StatusType.
 * @retval LIN_NOT_OK       Development or production error raised
 *                          none of the below conditions.
 * @retval LIN_TX_OK        Successful transmission.
 * @retval LIN_TX_BUSY      Ongoing transmission of header or response.
 * @retval LIN_TX_HEADER_ERROR Error occurred during header
 *                          transmission.
 * @retval LIN_TX_ERROR     Error occurred during response
 *                          transmission.
 * @retval LIN_RX_OK        Reception of correct response.
 * @retval LIN_RX_BUSY      Ongoing reception where at least one byte
 *                          has been received.
 * @retval LIN_RX_ERROR     Error occurred during reception.
 * @retval LIN_RX_NO_REPONSE No data byte has been received yet.
 * @retval LIN_OPERATIONAL  Channel is ready for next header.
 *                          transmission and no data are available.
 * @retval LIN_CH_SLEEP     Channel is in sleep mode.
 *
 *
 */
FUNC(Lin_StatusType, LIN_CODE) Lin_LPUART_HardwareGetStatus(CONST(uint8, AUTOMATIC) u8Channel, P2VAR(uint8, AUTOMATIC, LIN_APPL_DATA) pu8LinSduPtr)
{
    VAR(uint8, AUTOMATIC) u8Temp1;
    VAR(uint8, AUTOMATIC) u8Temp2;
    VAR(uint8, AUTOMATIC) u8TransmitHeaderCommand;
    VAR(uint8, AUTOMATIC) u8LinChFrameStatus;
    VAR(uint8, AUTOMATIC) u8ChannelFrameError;
    VAR(uint8, AUTOMATIC) u8ChannelFrameStatus;
    VAR(Lin_StatusType,AUTOMATIC) u8TempReturn = LIN_NOT_OK;

    u8Temp1 = Lin_Lpuart_au8BufferPtr[u8Channel];
    u8Temp2 = Lin_Lpuart_au8BufferLength[u8Channel];
    u8TransmitHeaderCommand = Lin_au8TransmitHeaderCommand[u8Channel];
    u8LinChFrameStatus = Lin_au8LinChFrameStatus[u8Channel];

    /* Frame transmission */
    if(((uint8)0U) != u8Temp2)
    {
        u8ChannelFrameError = Lin_au8LinChFrameErrorStatus[u8Channel];
        /* Header transmission */
        if((LPUART_PID_BYTE_OFFSET_U8 + ((uint8)1U)) >= u8Temp1)
        {
            switch(u8ChannelFrameError)
            {
                /* No error has occurred */
                case LIN_NO_ERROR:
                    if((LIN_TX_SLAVE_TO_SLAVE_COMMAND == u8TransmitHeaderCommand) && (LIN_TX_HEADER_COMPLETE_STATE == u8LinChFrameStatus))
                    {
                        u8TempReturn = LIN_TX_OK;
                    }
                    else if((LIN_TX_SLAVE_RES_COMMAND == u8TransmitHeaderCommand) && (LIN_TX_HEADER_COMPLETE_STATE == u8LinChFrameStatus))
                    {
                        u8TempReturn = LIN_RX_NO_RESPONSE;
                    }
                    else
                    {
                        u8TempReturn = LIN_TX_BUSY;
                    }
                    break;
                /* Errors occurred */
                case LIN_BIT_ERROR:
                    u8TempReturn = LIN_TX_HEADER_ERROR;
                    break;
                default:
                    u8TempReturn = LIN_NOT_OK;
                    break;
            }
        }
        /* Data transmission */
        else if(u8Temp2 > u8Temp1)
        {
            switch(u8ChannelFrameError)
            {
                /* No error has occurred */
                case LIN_NO_ERROR:
                    if(LIN_TX_SLAVE_RES_COMMAND == u8TransmitHeaderCommand)
                    {
                        if (LIN_RX_ONGOING_STATE == u8LinChFrameStatus)
                        {
                            u8TempReturn = LIN_RX_BUSY;
                        }
                    }
                    else if ((LIN_TX_SLAVE_TO_SLAVE_COMMAND == u8TransmitHeaderCommand) && (LIN_TX_COMPLETE_STATE == u8LinChFrameStatus))
                    {
                        u8TempReturn = LIN_TX_OK;
                    }
                    else
                    {
                        u8TempReturn = LIN_TX_BUSY;
                    }
                    break;
                /* Errors occurred */
                case LIN_BIT_ERROR:
                    u8TempReturn = LIN_TX_ERROR;
                    break;
                case LIN_NOISE_ERROR:
                    if(LIN_TX_SLAVE_RES_COMMAND == u8TransmitHeaderCommand)
                    {
                        u8TempReturn = LIN_RX_ERROR;
                    }
                    else
                    {
                        u8TempReturn = LIN_TX_ERROR;
                    }
                    break;
                case LIN_BUFFER_OVER_RUN_ERROR:
                case LIN_FRAMING_ERROR:
                    u8TempReturn = LIN_RX_ERROR;
                    break;
                default:
                    u8TempReturn = LIN_NOT_OK;
                    break;
            }
        }
        /* The last byte has been transmitted/received */
        else if(u8Temp2 == u8Temp1)
        {
            u8ChannelFrameStatus = Lin_au8LinChFrameStatus[u8Channel];

            switch(u8ChannelFrameError)
            {
                /* No error has occurred */
                case LIN_NO_ERROR:
                    if(LIN_TX_COMPLETE_STATE == u8ChannelFrameStatus)
                    {
                        u8TempReturn = LIN_TX_OK;
                        Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;
                    }
                    else if(LIN_RX_COMPLETE_STATE == u8ChannelFrameStatus)
                    {
                        /* Copy the data from hardware buffer */
                        Lin_LPUART_CopyData(u8Channel, pu8LinSduPtr);
                        Lin_Lpuart_au8BufferLength[u8Channel] = (uint8)0U;
                        u8TempReturn = LIN_RX_OK;
                    }
                    else
                    {
                        /* Code Flow Error */
                        u8TempReturn = LIN_NOT_OK;
                    }
                    break;
                /* Errors occurred */
                case LIN_NOISE_ERROR:
                    if(LIN_TX_SLAVE_RES_COMMAND == u8TransmitHeaderCommand)
                    {
                        u8TempReturn = LIN_RX_ERROR;
                    }
                    else
                    {
                        u8TempReturn = LIN_TX_ERROR;
                    }
                    break;
                case LIN_CHECKSUM_ERROR:
                case LIN_BUFFER_OVER_RUN_ERROR:
                case LIN_FRAMING_ERROR:
                    u8TempReturn = LIN_RX_ERROR;
                    break;
                default:
                    break;
            }
        }
        else
        {
            /* Code Flow Error */
            u8TempReturn = LIN_NOT_OK;
        }
    }
    /* LPUART is idle */
    else
    {
        u8TempReturn = LIN_OPERATIONAL;
    }
    return u8TempReturn;
}


/**
* @brief   Interrupt handler for TX and RX on LPUART.
* @details This function shall manage all the RX and TX ISRs on the
*          addressed channel.
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return       void.
*
* @implements Lin_LPUART_TxRxInterruptHandler_Activity
*
* @note         Internal driver function.
*/
FUNC(void, LIN_CODE) Lin_LPUART_TxRxInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel)
{
    VAR(uint8, AUTOMATIC) u8LogicalChannel = (uint8)0U;
    VAR(uint8, AUTOMATIC) u8BufferPtr;
    VAR(uint8, AUTOMATIC) u8Temp1;
    VAR(uint32, AUTOMATIC) u32Lin_Status;
    VAR(uint32, AUTOMATIC) u32Lin_EnabledInterrupts;
    VAR(uint32, AUTOMATIC) u32Lin_BaudReg;
    VAR(boolean, AUTOMATIC) bLPUART_reset = (boolean)FALSE;

    /* Check if driver is initialized */
    if(NULL_PTR != Lin_pcConfigPtr)
    {
        while(LIN_HW_MAX_AVAILABLE_MODULES > u8LogicalChannel)
        {
             if((sint32)u8LPUART_Channel == Lin_as8ChannelHardwareMap[Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelID])
             {
                break;
            }
            else
            {
                u8LogicalChannel++;
            }
        }

        if(LIN_HW_MAX_AVAILABLE_MODULES > u8LogicalChannel)
        {
            /* Get the logical channel index from physical channel */
             u8LogicalChannel = Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelID;
             /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            u32Lin_Status = REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & LPUART_STAT_INT_FLAGS_MASK_U32;
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            u32Lin_EnabledInterrupts = REG_READ32(LPUART_CTRL_ADDR32(u8LPUART_Channel)) & LPUART_CTRL_IE_FLAGS_MASK_U32;
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            u32Lin_BaudReg = REG_READ32(LPUART_BAUD_ADDR32(u8LPUART_Channel));

            if ((uint32)0U != u32Lin_Status)
            {
                /* Transmit Interrupt - Unused*/
                /* Transmit Data Register Empty Flag is set */
                if((LPUART_STAT_TDRE_MASK_U32 == (u32Lin_Status & LPUART_STAT_TDRE_MASK_U32)) && (LPUART_CTRL_TIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_TIE_MASK_U32)))
                {
                    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_10();
                    {
                        /* Disable Transmit Interrupts */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);

                        /* Enable Receiver Interrupt */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
                    }
                    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_10();

                    /* Transmit the next byte */
                    u8BufferPtr = Lin_Lpuart_au8BufferPtr[u8LogicalChannel];
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_DATA_ADDR32(u8LPUART_Channel), Lin_Lpuart_au8Buffer[u8LogicalChannel][u8BufferPtr]);

