xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
                }
                /* Transmission Complete Interrupt */
                /* Transmission Complete Flag is set */
                else if ((LPUART_STAT_TC_MASK_U32 == (u32Lin_Status & LPUART_STAT_TC_MASK_U32)) && (LPUART_CTRL_TCIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_TCIE_MASK_U32)))
                {
                    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_11();
                    {
                        /* Disable Transmission Complete Interrupt */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);

                        /* Enable Error Interrupts */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_ERR_FLAGS_MASK_U32));
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_RMW32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ONFIE_MASK_U32, LPUART_CTRL_ONFIE_ENABLE_U32);

                        /* Discard LPUART Rx Buffer */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_READ32(LPUART_DATA_ADDR32(u8LPUART_Channel));

                        /* Enable Receiver Interrupt */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
                    }
                    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_11();

                    /* Transmit the next byte */
                    u8BufferPtr = Lin_Lpuart_au8BufferPtr[u8LogicalChannel];
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_DATA_ADDR32(u8LPUART_Channel), Lin_Lpuart_au8Buffer[u8LogicalChannel][u8BufferPtr]);
                }
                /* Receiver Interrupt */
                /* Receive Data Register Full Flag is set */
                /** @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer */
                else if ((LPUART_STAT_RDRF_MASK_U32 == (u32Lin_Status & LPUART_STAT_RDRF_MASK_U32)) && (LPUART_CTRL_RIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_RIE_MASK_U32)))
                {
                    Lin_LPUART_RxBuffFullInterruptHandler(u8LPUART_Channel, u8LogicalChannel);
                }
                /* RX Input Active Edge Interrupt Detected */
                else if ((LPUART_STAT_RXEDGIF_MASK_U32 == (u32Lin_Status & LPUART_STAT_RXEDGIF_MASK_U32)) && \
                         /** @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer */
                         (LPUART_BAUD_RXEDGIE_MASK_U32 == (LPUART_BAUD_RXEDGIE_MASK_U32 & u32Lin_BaudReg)) \
                        )
                {
                    SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_19();
                    {
                        /* Clear RX Input Active Edge Interrupt Flag */
                       /**
                       *
                       * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                       *
                       * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                       */
                       REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_RXEDGIF_MASK_U32));
                        /* Disable RX Input Active Edge Interrupt */
                        /**
                        *
                        * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                        *
                        * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                        */
                        REG_BIT_CLEAR32(LPUART_BAUD_ADDR32(u8LPUART_Channel), LPUART_BAUD_RXEDGIE_MASK_U32);

                        u8Temp1 = Lin_au8LinChStatus[u8LogicalChannel];
                        /* Check whether the Lin channel status is in LIN_CH_SLEEP_STATE */
                        if (LIN_CH_SLEEP_STATE == u8Temp1)
                        {
                            /* Idle flag is set after one idle character is received */
                            /**
                            *
                            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                            *
                            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                            */
                            REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_IDLECFG_MASK_U32);

