xueshawu/S32K144/S32K144/Mcal/Lin_TS_T40D2M10I1R0/src/Lin_LPUART.c
                            /* Enable Idle Line Interrupt */
                            /**
                            *
                            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                            *
                            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                            */
                            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_IDLE_MASK_U32));
                            /**
                            *
                            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                            *
                            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                            */
                            REG_BIT_SET32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_ILIE_MASK_U32);
                        }
                        else
                        {
                            /* Do nothing */
                        }
                    }
                    SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_19();
                }
                /* Idle Line Interrupt Detected */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                else if ((LPUART_STAT_IDLE_MASK_U32 == (u32Lin_Status & LPUART_STAT_IDLE_MASK_U32)) && (LPUART_CTRL_ILIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_ILIE_MASK_U32)))
                {
                    Lin_LPUART_IdleLineDetectInterruptHandler(u8LPUART_Channel, u8LogicalChannel);
                }
                else
                {
                    /* The LPUART hardware should be reset, Disable Transmission Complete & Transmit Data Register Empty Interrupt */
                    bLPUART_reset = (boolean)TRUE;
                }
            }
            else
            {
                /* The LPUART hardware should be reset, Disable Transmission Complete & Transmit Data Register Empty Interrupt */
                bLPUART_reset = (boolean)TRUE;
            }
        }
        else
        {
            /* The LPUART hardware should be reset, Disable Transmission Complete & Transmit Data Register Empty Interrupt */
            bLPUART_reset = (boolean)TRUE;
        }
    }
    else
    {
        /* The LPUART hardware should be reset, Disable Transmission Complete & Transmit Data Register Empty Interrupt */
        bLPUART_reset = (boolean)TRUE;
    }

    if((boolean)TRUE == bLPUART_reset)
    {
        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_22();
        {
            /* Unknown interrupts, reset all flags */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_INT_FLAGS_MASK_U32));

            /* Disable Transmission Complete Interrupt */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TCIE_MASK_U32);
            /* Disable Transmit Data Register Empty Interrupt */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_TIE_MASK_U32);
            /* Disable Receiver Interrupt */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_BIT_CLEAR32(LPUART_CTRL_ADDR32(u8LPUART_Channel), LPUART_CTRL_RIE_MASK_U32);
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_22();
    }

    return; /* exit function with no return */
}

/**
* @brief   Interrupt handler for Error on LPUART.
* @details This function shall manage all the Error ISRs on the
*          addressed channel.
*
* @param[in]   Channel LIN channel to be addressed.
*
* @return       void.
*
*
* @note         Internal driver function.
*/
FUNC (void, LIN_CODE) Lin_LPUART_ErrorInterruptHandler(CONST(uint8, AUTOMATIC) u8LPUART_Channel)
{
    VAR(uint8, AUTOMATIC) u8LogicalChannel = (uint8)0U;
    VAR(uint32, AUTOMATIC) u32Lin_Status;
    VAR(uint32, AUTOMATIC) u32Lin_EnabledInterrupts;

    /* Check if driver is initialized */
    if(NULL_PTR != Lin_pcConfigPtr)
    {
        while(LIN_HW_MAX_AVAILABLE_MODULES > u8LogicalChannel)
        {
             if((sint32)u8LPUART_Channel == Lin_as8ChannelHardwareMap[Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelID])
             {
                break;
            }
            else
            {
                u8LogicalChannel++;
            }
        }

        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_23();
        {
            if(LIN_HW_MAX_AVAILABLE_MODULES > u8LogicalChannel)
            {
                /* Get the logical channel index from physical channel */
                 u8LogicalChannel = Lin_pChannelConfigPtr[u8LogicalChannel]->pChannelConfigPC->u8LinChannelID;
                 /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                u32Lin_Status = REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel));
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                u32Lin_EnabledInterrupts = REG_READ32(LPUART_CTRL_ADDR32(u8LPUART_Channel)) & LPUART_CTRL_IE_FLAGS_MASK_U32;

                /* Receiver Overrun Flag */
                if((LPUART_STAT_OR_MASK_U32 == (u32Lin_Status & LPUART_STAT_OR_MASK_U32)) && (LPUART_CTRL_ORIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_ORIE_MASK_U32)))
                {
                    /* Clear Receiver Overrun Flag */
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_OR_MASK_U32));
                    /* Set LIN channel frame error status to LIN_BUFFER_OVER_RUN_ERROR */
                    Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_BUFFER_OVER_RUN_ERROR;
                }
                /* Noise Flag */
                else if((LPUART_STAT_NF_MASK_U32 == (u32Lin_Status & LPUART_STAT_NF_MASK_U32)) && (LPUART_CTRL_NEIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_NEIE_MASK_U32)))
                {
                    /* Clear Noise Flag */
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_NF_MASK_U32));
                    /* Set LIN channel frame error status to LIN_NOISE_ERROR */
                    Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_NOISE_ERROR;
                }
                /* Framing Error Flag */
                else if((LPUART_STAT_FE_MASK_U32 == (u32Lin_Status & LPUART_STAT_FE_MASK_U32)) && (LPUART_CTRL_FEIE_MASK_U32 == (u32Lin_EnabledInterrupts & LPUART_CTRL_FEIE_MASK_U32)))
                {
                    /* Clear Framing Error Flag */
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_FE_MASK_U32));
                    /* Set LIN channel frame error status to LIN_FRAMING_ERROR */
                    Lin_au8LinChFrameErrorStatus[u8LogicalChannel] = LIN_FRAMING_ERROR;
                }
                /* Unknown Error Interrupts */
                else
                {
                    /* Reset all error interrupt flags */
                    /**
                    *
                    * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                    *
                    * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                    */
                    REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_ERR_FLAGS_MASK_U32));
                }
            }
            /* Unknown Error Interrupts */
            else
            {
                /* Reset all error interrupt flags */
                /**
                *
                * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
                *
                * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
                */
                REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_ERR_FLAGS_MASK_U32));
            }
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_23();
    }
    /* Unknown Error Interrupts */
    else
    {
        SchM_Enter_Lin_LIN_EXCLUSIVE_AREA_24();
        {
            /* Reset all error interrupt flags */
            /**
            *
            * @violates @ref Lin_LPUART_c_REF_3 cast from unsigned int to pointer
            *
            * @violates @ref Lin_LPUART_c_REF_7 cast should not be performed
            */
            REG_WRITE32(LPUART_STAT_ADDR32(u8LPUART_Channel), (uint32)((REG_READ32(LPUART_STAT_ADDR32(u8LPUART_Channel)) & (~LPUART_STAT_W1C_FLAGS_MASK_U32)) | LPUART_STAT_ERR_FLAGS_MASK_U32));
        }
        SchM_Exit_Lin_LIN_EXCLUSIVE_AREA_24();
    }

    return; /* exit function with no return */
}

#define LIN_STOP_SEC_CODE
/**
* @violates @ref Lin_LPUART_c_REF_1 #include statements in a file should
* only be preceded by other preprocessor directives or comments.
* @violates @ref Lin_LPUART_c_REF_2 Precautions shall be taken in
* order to prevent the contents of a header file being
* included twice.
*/
 #include "Lin_MemMap.h"
 
#ifdef __cplusplus
}
#endif
/** @} */
